// =====================================
// treeData.js Version2
// =====================================

const LEVEL_X = [
    80,
    180,
    320,
    500,
    700,
    930
];
//=========================
// Root
//=========================
const TREE_NODES = [
{
    id:"",
    kana:"",
    x:LEVEL_X[0],
    y:650
},
//=========================
// Level1
//=========================

{
    id:"・",
    kana:"ヘ",
    x:LEVEL_X[1],
    y:820
},
{
    id:"ー",
    kana:"ム",
    x:LEVEL_X[1],
    y:480
},
//=========================
// Level2
//=========================

{
    id:"・・",
    kana:"イ",
    x:LEVEL_X[2],
    y:920
},
{
    id:"・ー",
    kana:"ヤ",
    x:LEVEL_X[2],
    y:740
},
{
    id:"ー・",
    kana:"タ",
    x:LEVEL_X[2],
    y:560
},
{
    id:"ーー",
    kana:"ヨ",
    x:LEVEL_X[2],
    y:380
},
//=========================
// Level3
//=========================

{
    id:"・・・",
    kana:"ナ",
    x:LEVEL_X[3],
    y:1000
},
{
    id:"・・ー",
    kana:"ウ",
    x:LEVEL_X[3],
    y:900
},
{
    id:"・ー・",
    kana:"ツ",
    x:LEVEL_X[3],
    y:800
},
{
    id:"・ーー",
    kana:"ヲ",
    x:LEVEL_X[3],
    y:700
},
{
    id:"ー・・",
    kana:"ホ",
    x:LEVEL_X[3],
    y:600
},
{
    id:"ー・ー",
    kana:"ワ",
    x:LEVEL_X[3],
    y:500
},
{
    id:"ーー・",
    kana:"リ",
    x:LEVEL_X[3],
    y:400
},
{
    id:"ーーー",
    kana:"レ",
    x:LEVEL_X[3],
    y:300
},
//=========================
// Level4
//=========================

// ナ
{
    id:"・・・・",
    kana:"ヌ",
    x:LEVEL_X[4],
    y:1020
},
{
    id:"・・・ー",
    kana:"ク",
    x:LEVEL_X[4],
    y:960
},

// ウ
{
    id:"・・ー・",
    kana:"チ",
    x:LEVEL_X[4],
    y:900
},
{
    id:"・・ーー",
    kana:"ノ",
    x:LEVEL_X[4],
    y:840
},

// ヤ
{
    id:"・ー・・",
    kana:"カ",
    x:LEVEL_X[4],
    y:780
},
{
    id:"・ー・ー",
    kana:"ロ",
    x:LEVEL_X[4],
    y:720
},

// ヲ
{
    id:"・ーー・",
    kana:"ツ",
    x:LEVEL_X[4],
    y:660
},
{
    id:"・ーーー",
    kana:"ヲ",
    x:LEVEL_X[4],
    y:600
},

// ホ
{
    id:"ー・・・",
    kana:"ハ",
    x:LEVEL_X[4],
    y:540
},
{
    id:"ー・・ー",
    kana:"マ",
    x:LEVEL_X[4],
    y:480
},

// ワ
{
    id:"ー・ー・",
    kana:"ニ",
    x:LEVEL_X[4],
    y:420
},
{
    id:"ー・ーー",
    kana:"ケ",
    x:LEVEL_X[4],
    y:360
},

// リ
{
    id:"ーー・・",
    kana:"フ",
    x:LEVEL_X[4],
    y:300
},
{
    id:"ーー・ー",
    kana:"ネ",
    x:LEVEL_X[4],
    y:240
},

// レ
{
    id:"ーーー・",
    kana:"ソ",
    x:LEVEL_X[4],
    y:180
},
{
    id:"ーーーー",
    kana:"コ",
    x:LEVEL_X[4],
    y:120
},
//=========================
// Level5
//=========================

// ヌ
{ id:"・・・・・", kana:"5",   x:LEVEL_X[5],      y:1020 },
{ id:"・・・・ー", kana:"4",   x:LEVEL_X[5]+80,   y:1020 },

// ク
{ id:"・・・ー・", kana:"起終", x:LEVEL_X[5],      y:960 },
{ id:"・・・ーー", kana:"3",   x:LEVEL_X[5]+80,   y:960 },

// チ
{ id:"・・ー・・", kana:"ト",  x:LEVEL_X[5],      y:900 },
{ id:"・・ー・ー", kana:"ミ",  x:LEVEL_X[5]+80,   y:900 },

// ノ
{ id:"・・ーー・", kana:"゜",  x:LEVEL_X[5],      y:840 },
{ id:"・・ーーー", kana:"2",   x:LEVEL_X[5]+80,   y:840 },

// カ
{ id:"・ー・・・", kana:"オ",  x:LEVEL_X[5],      y:780 },
{ id:"・ー・・ー", kana:"ヰ",  x:LEVEL_X[5]+80,   y:780 },

// ロ
{ id:"・ー・ー・", kana:"ン",  x:LEVEL_X[5],      y:720 },
{ id:"・ー・ーー", kana:"テ",  x:LEVEL_X[5]+80,   y:720 },

// ツ
{ id:"・ーー・・", kana:"ヱ",  x:LEVEL_X[5],      y:660 },
{ id:"・ーー・ー", kana:"ー",  x:LEVEL_X[5]+80,   y:660 },

// ヲ
{ id:"・ーーー・", kana:"セ",  x:LEVEL_X[5],      y:600 },
{ id:"・ーーーー", kana:"1",   x:LEVEL_X[5]+80,   y:600 },

// ハ
{ id:"ー・・・・", kana:"6",   x:LEVEL_X[5],      y:540 },
{ id:"ー・・・ー", kana:"メ",  x:LEVEL_X[5]+80,   y:540 },

// マ
{ id:"ー・・ー・", kana:"モ",  x:LEVEL_X[5],      y:480 },
{ id:"ー・・ーー", kana:"ユ",  x:LEVEL_X[5]+80,   y:480 },

// ニ
{ id:"ー・ー・・", kana:"キ",  x:LEVEL_X[5],      y:420 },
{ id:"ー・ー・ー", kana:"サ",  x:LEVEL_X[5]+80,   y:420 },

// ケ
{ id:"ー・ーー・", kana:"ル",  x:LEVEL_X[5],      y:360 },
{ id:"ー・ーーー", kana:"エ",  x:LEVEL_X[5]+80,   y:360 },

// フ
{ id:"ーー・・・", kana:"7",   x:LEVEL_X[5],      y:300 },
{ id:"ーー・・ー", kana:"ヒ",  x:LEVEL_X[5]+80,   y:300 },

// ネ
{ id:"ーー・ー・", kana:"シ",  x:LEVEL_X[5],      y:240 },
{ id:"ーー・ーー", kana:"ア",  x:LEVEL_X[5]+80,   y:240 },

// ソ
{ id:"ーーー・・", kana:"8",   x:LEVEL_X[5],      y:180 },
{ id:"ーーー・ー", kana:"ス",  x:LEVEL_X[5]+80,   y:180 },

// コ
{ id:"ーーーー・", kana:"9",   x:LEVEL_X[5],      y:120 },
{ id:"ーーーーー", kana:"0",   x:LEVEL_X[5]+80,   y:120 },
];
